#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
random_string.random: Refreshing state... [id=0r6pob]
module.in_app_metrics.module.csv_etl.random_string.bucket_random_id: Refreshing state... [id=ftbuy]
aws_acm_certificate.retrieval_covidshield: Refreshing state... [id=arn:aws:acm:us-east-1:005133826942:certificate/af342fd8-8ae9-4dcb-99f1-d9b9460f9c0f]
aws_wafv2_web_acl.key_retrieval_cdn: Refreshing state... [id=c70e4ca5-1d56-4909-9611-b994a42d22fa]
aws_api_gateway_api_key.metrics_api_key: Refreshing state... [id=tha1pto6eg]
aws_secretsmanager_secret.key_retrieval_env_ecdsa_key: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-retrieval-env-ecdsa-key-0r6pob-Dbo4Qd]
module.in_app_metrics.module.csv_etl.aws_vpc.main: Refreshing state... [id=vpc-05171934e2a4c96c9]
aws_vpc.covidshield: Refreshing state... [id=vpc-06fbc7337b116cce1]
module.in_app_metrics.aws_dynamodb_table.aggregate_metrics: Refreshing state... [id=aggregate_metrics]
aws_route53_health_check.covidshield_key_submission_healthcheck: Refreshing state... [id=590ba1b2-e8bd-43a9-bfda-3f35ed44484c]
aws_acm_certificate.covidshield: Refreshing state... [id=arn:aws:acm:ca-central-1:005133826942:certificate/2458141b-63d1-4d37-bb2c-3e0f68e38cfd]
aws_wafv2_web_acl.key_retrieval: Refreshing state... [id=691f016d-bf45-4ae9-979a-a9df848ea422]
aws_route53_health_check.covidshield_key_retrieval_healthcheck: Refreshing state... [id=4866eebf-9567-41bf-984c-e6616d3b245e]
aws_ecs_cluster.covidshield: Refreshing state... [id=arn:aws:ecs:ca-central-1:005133826942:cluster/CovidShield]
aws_iam_role.role: Refreshing state... [id=save-metrics.role]
aws_iam_role.lambda_validate_deploy: Refreshing state... [id=lambda-validate-deploy]
module.in_app_metrics.module.csv_etl.aws_cloudwatch_event_rule.twice-a-day: Refreshing state... [id=twice-a-day]
aws_secretsmanager_secret.key_submission_metrics_password: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-metric-password-0r6pob-3e5ppZ]
aws_iam_role.firehose_waf_logs: Refreshing state... [id=firehose_waf_logs]
aws_wafv2_ip_set.new_key_claim: Refreshing state... [id=4c12748b-a97a-4e9d-ae37-4fac954418bf]
aws_wafv2_web_acl.metrics_collection: Refreshing state... [id=378af4bf-0cc4-466d-b45f-68231da0cb7a]
aws_ecr_repository.repository["key-retrieval"]: Refreshing state... [id=covid-server/key-retrieval]
aws_ecr_repository.repository["monolith"]: Refreshing state... [id=covid-server/monolith]
aws_ecr_repository.repository["key-submission"]: Refreshing state... [id=covid-server/key-submission]
module.in_app_metrics.module.csv_etl.aws_eip.lambda: Refreshing state... [id=eipalloc-0daad4abab4b22cc3]
module.in_app_metrics.aws_kms_key.metrics_key: Refreshing state... [id=47379609-95bb-4691-a3d0-7e70bb8d8684]
module.in_app_metrics.aws_dynamodb_table.raw_metrics: Refreshing state... [id=raw_metrics]
aws_iam_role.covidshield_key_submission: Refreshing state... [id=KeySubmission]
module.in_app_metrics.module.csv_etl.aws_ecr_repository.create_csv: Refreshing state... [id=covid-server/metrics-server]
aws_iam_role.api_gatway_cloudwatch_role: Refreshing state... [id=save-metricsapi_gateway_cloudwatch_role]
aws_route53_zone.covidshield: Refreshing state... [id=Z04433932EK0CRE7JPWYS]
aws_route53_health_check.covidshield_key_retrieval_healthcheck_region_json: Refreshing state... [id=a331d481-399b-4bfd-9546-a49c67f2c0c2]
aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E2UM372AG7L2ZR]
aws_cloudwatch_log_group.metrics: Refreshing state... [id=/aws/lambda/save-metrics]
aws_secretsmanager_secret.server_database_url: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:005133826942:secret:server-database-url-0r6pob-fA6Kbq]
aws_iam_role.vpc_flow_logs: Refreshing state... [id=vpc_flow_logs]
aws_secretsmanager_secret.key_submission_env_key_claim_token: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-submission-env-key-claim-token-0r6pob-q1ljoQ]
module.in_app_metrics.module.metrics_data_vm.aws_key_pair.ssh_key: Refreshing state... [id=dev_key]
aws_route53_health_check.covidshield_key_retrieval_healthcheck_ca_json: Refreshing state... [id=f04e8175-09f3-4965-b93b-fba7405154cb]
aws_secretsmanager_secret.key_retrieval_env_hmac_key: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-retrieval-env-hmac-key-0r6pob-oGGsIt]
aws_api_gateway_rest_api.metrics: Refreshing state... [id=rpjvmf2ukd]
module.in_app_metrics.module.metrics_data_vm.aws_vpc.main: Refreshing state... [id=vpc-01efdd87d52cfa6ff]
aws_iam_role.covidshield_key_retrieval: Refreshing state... [id=KeyRetrieval]
module.in_app_metrics.aws_iam_role.aggregator: Refreshing state... [id=aggregate_lambda_role]
module.in_app_metrics.module.csv_etl.aws_s3_bucket.masked_metrics: Refreshing state... [id=masked-metrics-ftbuy-staging]
module.in_app_metrics.module.csv_etl.aws_s3_bucket.unmasked_metrics: Refreshing state... [id=unmasked-metrics-ftbuy-staging]
module.in_app_metrics.aws_iam_role.backoff: Refreshing state... [id=backoff_lambda_role]
aws_secretsmanager_secret_version.key_retrieval_env_ecdsa_key: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-retrieval-env-ecdsa-key-0r6pob-Dbo4Qd|942EFC36-1A49-4160-8E17-3150DFD46E8F]
aws_iam_role.codedeploy: Refreshing state... [id=codedeploy]
module.in_app_metrics.module.csv_etl.aws_iam_policy.vpc_networking: Refreshing state... [id=arn:aws:iam::005133826942:policy/csv_etlVpcNetworking]
aws_secretsmanager_secret_version.key_submission_metrics_password: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-metric-password-0r6pob-3e5ppZ|2B43B497-FCB3-4CEA-B5F6-4FFF96AE6963]
aws_iam_role_policy_attachment.lambda_validate_deploy: Refreshing state... [id=lambda-validate-deploy-20200727193113071300000001]
aws_iam_role_policy.lambda_validate_codedeploy: Refreshing state... [id=lambda-validate-deploy:LambdaValidateCodeDeploy]
module.in_app_metrics.aws_iam_policy.vpc_networking: Refreshing state... [id=arn:aws:iam::005133826942:policy/CovidAlertVplNetworking]
aws_ecr_lifecycle_policy.policy["monolith"]: Refreshing state... [id=covid-server/monolith]
aws_ecr_lifecycle_policy.policy["key-retrieval"]: Refreshing state... [id=covid-server/key-retrieval]
aws_ecr_lifecycle_policy.policy["key-submission"]: Refreshing state... [id=covid-server/key-submission]
aws_iam_role_policy_attachment.ecs_task_execution_key_submission: Refreshing state... [id=KeySubmission-20200602222525692500000004]
module.in_app_metrics.aws_iam_policy.write_logs: Refreshing state... [id=arn:aws:iam::005133826942:policy/CovidAlertLogWriter]
module.in_app_metrics.module.csv_etl.aws_iam_role.metrics_csv: Refreshing state... [id=metrics_csv_lambda_role]
module.in_app_metrics.aws_sqs_queue.aggregation_lambda_dead_letter: Refreshing state... [id=https://sqs.ca-central-1.amazonaws.com/005133826942/aggregation-lambda-dead-letter-queue]
module.in_app_metrics.module.csv_etl.aws_iam_policy.write_logs: Refreshing state... [id=arn:aws:iam::005133826942:policy/csv_etlLogWriter]
aws_shield_protection.route53_covidshield[0]: Refreshing state... [id=64bc3981-ab8f-45bc-ab63-085a5713d37d]
aws_route53_record.retrieval_covidshield_certificate_validation["retrieval.wild-samphire.cdssandbox.xyz"]: Refreshing state... [id=Z04433932EK0CRE7JPWYS__b13a4895c584eec12f4f7dcc773be991.retrieval.wild-samphire.cdssandbox.xyz._CNAME]
aws_wafv2_web_acl.key_submission: Refreshing state... [id=a4a38f51-4df7-4869-b85d-c5efcad21975]
aws_api_gateway_domain_name.metrics: Refreshing state... [id=metrics.wild-samphire.cdssandbox.xyz]
aws_route53_record.covidshield_certificate_validation["wild-samphire.cdssandbox.xyz"]: Refreshing state... [id=Z04433932EK0CRE7JPWYS__0c39db230baa61f4d0ac135fb798441a.wild-samphire.cdssandbox.xyz._CNAME]
aws_route53_record.covidshield_certificate_validation["*.wild-samphire.cdssandbox.xyz"]: Refreshing state... [id=Z04433932EK0CRE7JPWYS__0c39db230baa61f4d0ac135fb798441a.wild-samphire.cdssandbox.xyz._CNAME]
aws_default_network_acl.covidshield: Refreshing state... [id=acl-05e6c26d51f1808a6]
aws_security_group.covidshield_key_submission: Refreshing state... [id=sg-01c8d2505904ab6c7]
aws_security_group.covidshield_key_retrieval: Refreshing state... [id=sg-0dccc93503d5844ed]
aws_internet_gateway.covidshield: Refreshing state... [id=igw-087e301b2766b65d1]
aws_lb_target_group.covidshield_key_submission_2: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:005133826942:targetgroup/covidshield-key-submission-2/4ce0a8eb89ba3700]
aws_lb_target_group.covidshield_key_retrieval_2: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:005133826942:targetgroup/covidshield-key-retrieval-2/8338d86d80abb99e]
aws_vpc_endpoint.s3: Refreshing state... [id=vpce-03d928d3aab2d6a2d]
aws_default_security_group.default: Refreshing state... [id=sg-0f906dc95efb9f8c5]
aws_lb_target_group.covidshield_key_submission: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:005133826942:targetgroup/covidshield-key-submission/8bdfb6dab38f61bc]
aws_security_group.privatelink: Refreshing state... [id=sg-0e0070c8141ce36a5]
aws_lb_target_group.covidshield_key_retrieval: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:005133826942:targetgroup/covidshield-key-retrieval/c7b5925456e52396]
aws_iam_role_policy.cloudwatch: Refreshing state... [id=save-metricsapi_gateway_cloudwatch_role:default]
aws_api_gateway_account.demo: Refreshing state... [id=api-gateway-account]
module.in_app_metrics.module.csv_etl.aws_internet_gateway.gw: Refreshing state... [id=igw-09096629e0c9dcfd5]
module.in_app_metrics.module.csv_etl.aws_default_security_group.default: Refreshing state... [id=sg-0bca06f1ba9d133de]
module.in_app_metrics.module.csv_etl.aws_default_network_acl.default: Refreshing state... [id=acl-08dd94cb5d2af94e4]
module.in_app_metrics.module.csv_etl.aws_default_route_table.default: Refreshing state... [id=rtb-05f39acb3200dd87c]
module.in_app_metrics.module.csv_etl.aws_subnet.private: Refreshing state... [id=subnet-0ad10d2c67c9651ee]
module.in_app_metrics.module.csv_etl.aws_subnet.public: Refreshing state... [id=subnet-06523554550d482c3]
module.in_app_metrics.module.csv_etl.aws_security_group.lambda: Refreshing state... [id=sg-0ba55405eef7b6c94]
aws_s3_bucket.firehose_waf_logs: Refreshing state... [id=covid-shield-staging-waf-logs]
aws_kms_key.cw_us_east: Refreshing state... [id=79838c16-349c-47bc-a142-ad819e31bec1]
aws_s3_bucket.cloudfront_logs: Refreshing state... [id=covid-shield-staging-cloudfront-logs]
aws_s3_bucket.exposure_config: Refreshing state... [id=covid-shield-exposure-config-staging]
aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::005133826942:policy/save-metrics]
aws_kms_key.cw: Refreshing state... [id=f190bddc-b122-446d-aaa3-f013f6ba43ad]
module.in_app_metrics.aws_vpc_endpoint.dynamodb: Refreshing state... [id=vpce-012db21ec99e15188]
aws_subnet.covidshield_public[1]: Refreshing state... [id=subnet-00801f4347017b594]
aws_subnet.covidshield_public[2]: Refreshing state... [id=subnet-02247d31a6dae842c]
aws_subnet.covidshield_public[0]: Refreshing state... [id=subnet-0b6825247e5637145]
aws_subnet.covidshield_private[0]: Refreshing state... [id=subnet-034f98e3cdd11a7ef]
aws_subnet.covidshield_private[1]: Refreshing state... [id=subnet-083e2bb4d6a9edf1d]
aws_subnet.covidshield_private[2]: Refreshing state... [id=subnet-05ffd2f0b629a7731]
aws_secretsmanager_secret_version.key_submission_env_key_claim_token: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-submission-env-key-claim-token-0r6pob-q1ljoQ|1205CD49-CD91-4B09-996C-5FC458FAA6C9]
aws_secretsmanager_secret_version.key_retrieval_env_hmac_key: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-retrieval-env-hmac-key-0r6pob-oGGsIt|2071D0FB-069E-4028-96EC-2A27AEA3B5BA]
aws_api_gateway_resource.create_resource: Refreshing state... [id=v2izi2]
aws_cloudwatch_log_group.api_log_group: Refreshing state... [id=API-Gateway-Execution-Logs_rpjvmf2ukd/staging]
aws_api_gateway_usage_plan.metrics_usage_plan: Refreshing state... [id=fgpf7m]
aws_api_gateway_deployment.metrics: Refreshing state... [id=gekfc9]
aws_api_gateway_request_validator.metrics_model: Refreshing state... [id=ex8w8v]
aws_api_gateway_model.metrics_model: Refreshing state... [id=p550fw]
aws_iam_role_policy.vpc_flow_logs: Refreshing state... [id=vpc_flow_logs:vpc_flow_logs]
module.in_app_metrics.aws_iam_policy.aggregate_metrics_stream_processor: Refreshing state... [id=arn:aws:iam::005133826942:policy/CovidAlertAggregateMetricsStreamProcessor]
module.in_app_metrics.aws_iam_policy.aggregate_metrics_update: Refreshing state... [id=arn:aws:iam::005133826942:policy/CovidAlertAggregateMetricsUpdateItem]
aws_iam_role_policy_attachment.ecs_task_execution_key_retrieval: Refreshing state... [id=KeyRetrieval-20200602222525384200000003]
module.in_app_metrics.module.csv_etl.aws_iam_policy.pull_create_csv_image_policy: Refreshing state... [id=arn:aws:iam::005133826942:policy/csv_etlPullCreateCSVImage]
aws_iam_role_policy_attachment.codedeploy: Refreshing state... [id=codedeploy-20200710192933426100000001]
module.in_app_metrics.aws_iam_role_policy_attachment.aggregator_vpc_networking: Refreshing state... [id=aggregate_lambda_role-20210210161233544400000003]
module.in_app_metrics.aws_iam_role_policy_attachment.backoff_vpc_networking: Refreshing state... [id=backoff_lambda_role-20210212154558944800000004]
module.in_app_metrics.aws_iam_role_policy_attachment.aggregator_log_writer: Refreshing state... [id=aggregate_lambda_role-20210210161233537300000002]
module.in_app_metrics.aws_iam_role_policy_attachment.backoff_log_writer: Refreshing state... [id=backoff_lambda_role-20210212154558924000000001]
module.in_app_metrics.module.csv_etl.aws_iam_role_policy_attachment.metrics_csv_vpc_networking: Refreshing state... [id=metrics_csv_lambda_role-20210427205050001100000001]
module.in_app_metrics.module.csv_etl.aws_iam_role_policy_attachment.metrics_csv_log_writer: Refreshing state... [id=metrics_csv_lambda_role-20210427205050007700000003]
aws_route53_record.covidshield_metrics_submission: Refreshing state... [id=Z04433932EK0CRE7JPWYS_metrics.wild-samphire.cdssandbox.xyz_A]
aws_acm_certificate_validation.retrieval_covidshield: Refreshing state... [id=2020-06-02 22:27:57 +0000 UTC]
aws_security_group.covidshield_redis[0]: Refreshing state... [id=sg-00428626a8255eeb8]
aws_security_group.covidshield_database: Refreshing state... [id=sg-06be84cecd0622042]
aws_route_table.covidshield_public_subnet: Refreshing state... [id=rtb-03861af82fb085c83]
aws_acm_certificate_validation.covidshield: Refreshing state... [id=2020-06-02 22:27:15 +0000 UTC]
module.in_app_metrics.module.metrics_data_vm.aws_default_security_group.default: Refreshing state... [id=sg-0359dd2e3b067da97]
module.in_app_metrics.module.metrics_data_vm.aws_subnet.public: Refreshing state... [id=subnet-06e8c1db213da743b]
module.in_app_metrics.module.metrics_data_vm.aws_vpc_endpoint.dynamodb: Refreshing state... [id=vpce-0dfb7013b0b41936f]
module.in_app_metrics.module.metrics_data_vm.aws_internet_gateway.gw: Refreshing state... [id=igw-02ae7e70a5b709d61]
aws_security_group_rule.privatelink_retrieval_ingress: Refreshing state... [id=sgrule-2545732239]
aws_security_group_rule.covidshield_key_submission_egress_privatelink: Refreshing state... [id=sgrule-887278672]
aws_security_group_rule.covidshield_key_retrieval_egress_privatelink: Refreshing state... [id=sgrule-75996846]
aws_security_group_rule.privatelink_submission_ingress: Refreshing state... [id=sgrule-1094651719]
aws_security_group_rule.covidshield_key_retrieval_egress_s3_privatelink: Refreshing state... [id=sgrule-2719532639]
aws_security_group_rule.covidshield_key_submission_egress_s3_privatelink: Refreshing state... [id=sgrule-437173826]
module.in_app_metrics.module.csv_etl.aws_route_table.public: Refreshing state... [id=rtb-01562393f1ae72f44]
module.in_app_metrics.aws_iam_policy.raw_metrics_put: Refreshing state... [id=arn:aws:iam::005133826942:policy/CovidAlertRawMetricsPutItem]
module.in_app_metrics.aws_iam_policy.raw_metrics_stream_processor: Refreshing state... [id=arn:aws:iam::005133826942:policy/CovidAlertRawMetricsStreamProcessor]
module.in_app_metrics.module.csv_etl.aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-0cde3869dc0bdb4ef]
module.in_app_metrics.module.csv_etl.aws_security_group_rule.inet_egress: Refreshing state... [id=sgrule-3376250955]
module.in_app_metrics.module.csv_etl.aws_iam_policy.aggregate_metrics_read: Refreshing state... [id=arn:aws:iam::005133826942:policy/csv_etlAggregateMetricsRead]
aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=save-metrics.role-20210204201602135000000001]
module.in_app_metrics.module.csv_etl.aws_lambda_function.masked_metrics: Refreshing state... [id=masked_metrics]
module.in_app_metrics.module.csv_etl.aws_lambda_function.unmasked_metrics: Refreshing state... [id=unmasked_metrics]
aws_sns_topic.alert_warning_us_east: Refreshing state... [id=arn:aws:sns:us-east-1:005133826942:alert-warning]
aws_sns_topic.alert_critical_us_east: Refreshing state... [id=arn:aws:sns:us-east-1:005133826942:alert-critical]
aws_iam_policy.covidshield_secrets_manager_key_submission: Refreshing state... [id=arn:aws:iam::005133826942:policy/CovidShieldSecretsManagerKeySubmission]
module.in_app_metrics.aws_security_group.backoff_retry_sg: Refreshing state... [id=sg-09c44da321f64bfa7]
module.in_app_metrics.aws_security_group.aggregate_metrics_sg: Refreshing state... [id=sg-0f5deb27e9735bd29]
aws_iam_policy.covidshield_secrets_manager_key_retrieval: Refreshing state... [id=arn:aws:iam::005133826942:policy/CovidShieldSecretsManagerKeyRetrieval]
aws_security_group.covidshield_load_balancer: Refreshing state... [id=sg-0296a1b94945261b0]
aws_vpc_endpoint.sqs: Refreshing state... [id=vpce-08dfaf47e44d74a17]
aws_vpc_endpoint.kms: Refreshing state... [id=vpce-0e382c0d4499a5cfd]
aws_elasticache_subnet_group.covidshield[0]: Refreshing state... [id=covidshield]
aws_db_subnet_group.covidshield: Refreshing state... [id=server]
aws_vpc_endpoint.secretsmanager: Refreshing state... [id=vpce-00624d24717c416b9]
aws_vpc_endpoint.monitoring: Refreshing state... [id=vpce-0a75ab51de2941758]
aws_vpc_endpoint.logs: Refreshing state... [id=vpce-04c456686a79e9277]
aws_cloudwatch_log_group.vpc_flow_logs: Refreshing state... [id=vpc_flow_logs]
aws_sns_topic.alert_warning: Refreshing state... [id=arn:aws:sns:ca-central-1:005133826942:alert-warning]
aws_cloudwatch_log_group.covidshield: Refreshing state... [id=CovidShield]
aws_sns_topic.alert_critical: Refreshing state... [id=arn:aws:sns:ca-central-1:005133826942:alert-critical]
aws_api_gateway_stage.metrics: Refreshing state... [id=ags-rpjvmf2ukd-staging]
aws_api_gateway_usage_plan_key.main: Refreshing state... [id=tha1pto6eg]
aws_api_gateway_method.create_method: Refreshing state... [id=agm-rpjvmf2ukd-v2izi2-POST]
module.in_app_metrics.aws_iam_policy.read_write_and_encrypt_deadletter_queue: Refreshing state... [id=arn:aws:iam::005133826942:policy/CovidAlertReadWriteAndEncryptDeadletterQueue]
module.in_app_metrics.aws_iam_policy.write_and_encrypt_deadletter_queue: Refreshing state... [id=arn:aws:iam::005133826942:policy/CovidAlertWriteAndEncryptDeadletterQueue]
module.in_app_metrics.module.csv_etl.aws_iam_role_policy_attachment.metrics_csv_pull_create_csv_image: Refreshing state... [id=metrics_csv_lambda_role-20210427205050002000000002]
module.in_app_metrics.aws_iam_role_policy_attachment.backoff_update: Refreshing state... [id=backoff_lambda_role-20210212154558928300000003]
module.in_app_metrics.aws_iam_role_policy_attachment.aggregator_update: Refreshing state... [id=aggregate_lambda_role-20210211150112407400000001]
aws_security_group_rule.covidshield_key_submission_egress_redis[0]: Refreshing state... [id=sgrule-1395854673]
aws_security_group_rule.covidshield_key_retrieval_egress_redis[0]: Refreshing state... [id=sgrule-1550434783]
aws_security_group_rule.covidshield_key_submission_egress_database: Refreshing state... [id=sgrule-3512353909]
aws_security_group_rule.covidshield_key_retrieval_egress_database: Refreshing state... [id=sgrule-3724577019]
module.in_app_metrics.module.metrics_data_vm.aws_default_network_acl.default: Refreshing state... [id=acl-0eb01e414aac47627]
aws_route_table_association.covidshield[0]: Refreshing state... [id=rtbassoc-06840ee480651c555]
aws_route_table_association.covidshield[1]: Refreshing state... [id=rtbassoc-0125db6a42d62bdc4]
aws_route_table_association.covidshield[2]: Refreshing state... [id=rtbassoc-0e354c2cca8e3649a]
module.in_app_metrics.module.metrics_data_vm.aws_network_interface.ni: Refreshing state... [id=eni-004497be6809b9bee]
module.in_app_metrics.module.metrics_data_vm.aws_default_route_table.r: Refreshing state... [id=rtb-0dbddb3ae508ed1c8]
aws_security_group.lambda_sg: Refreshing state... [id=sg-068c55bbe207b9a2d]
module.in_app_metrics.module.csv_etl.aws_route_table_association.public: Refreshing state... [id=rtbassoc-0caa2dfd055d07dc4]
module.in_app_metrics.module.csv_etl.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-01eb349eb70451e78]
module.in_app_metrics.module.csv_etl.aws_vpc_endpoint.dynamodb: Refreshing state... [id=vpce-0a3ee12e6459e348b]
module.in_app_metrics.aws_iam_role_policy_attachment.raw_metrics_put: Refreshing state... [id=save-metrics.role-20210209185616136100000001]
module.in_app_metrics.module.csv_etl.aws_iam_policy.write_s3_metrics_csv_buckets: Refreshing state... [id=arn:aws:iam::005133826942:policy/csv_etlWriteS3CSVBuckets]
module.in_app_metrics.module.csv_etl.aws_route_table.private: Refreshing state... [id=rtb-0eb109fb4ae66e4c7]
module.in_app_metrics.aws_iam_role_policy_attachment.backoff_raw_metrics_stream_processor: Refreshing state... [id=backoff_lambda_role-20210212154558927400000002]
module.in_app_metrics.aws_iam_role_policy_attachment.aggregator_raw_metrics_stream_processor: Refreshing state... [id=aggregate_lambda_role-20210210161233529600000001]
module.in_app_metrics.module.csv_etl.aws_iam_role_policy_attachment.metrics_csv_aggregate_streams: Refreshing state... [id=metrics_csv_lambda_role-20210427205050015100000004]
aws_kinesis_firehose_delivery_stream.firehose_waf_logs_us_east: Refreshing state... [id=arn:aws:firehose:us-east-1:005133826942:deliverystream/aws-waf-logs-covid-shield-us-east]
aws_kinesis_firehose_delivery_stream.firehose_waf_logs: Refreshing state... [id=arn:aws:firehose:ca-central-1:005133826942:deliverystream/aws-waf-logs-covid-shield]
aws_s3_bucket_public_access_block.firehose_waf_logs: Refreshing state... [id=covid-shield-staging-waf-logs]
aws_iam_role_policy.firehose_waf_logs: Refreshing state... [id=firehose_waf_logs:firehose-waf-logs-policy]
aws_s3_bucket_public_access_block.cloudfront_logs: Refreshing state... [id=covid-shield-staging-cloudfront-logs]
module.in_app_metrics.aws_lambda_function.backoff_retry: Refreshing state... [id=backoff_retry]
aws_iam_role_policy_attachment.secrets_manager_key_submission: Refreshing state... [id=KeySubmission-20200602222528088400000006]
module.in_app_metrics.aws_security_group_rule.privatelink_metrics_backoff_ingress: Refreshing state... [id=sgrule-2227647019]
module.in_app_metrics.aws_security_group_rule.privatelink_metrics_aggregator: Refreshing state... [id=sgrule-3674221538]
module.in_app_metrics.aws_lambda_function.aggregate_metrics: Refreshing state... [id=aggregate_metrics]
aws_cloudwatch_metric_alarm.route53_retrieval_health_check_region_json: Refreshing state... [id=Route53RetrievalHealthCheckRegionJson]
aws_cloudwatch_metric_alarm.route53_submission_health_check: Refreshing state... [id=Route53SubmissionHealthCheck]
aws_cloudwatch_metric_alarm.route53_retrieval_health_check_ca_json: Refreshing state... [id=Route53RetrievalHealthCheckCAJson]
aws_cloudwatch_metric_alarm.route53_retrieval_health_check: Refreshing state... [id=Route53RetrievalHealthCheck]
aws_cloudwatch_metric_alarm.ddos_detected_route53: Refreshing state... [id=DDoSDetectedRoute53]
aws_s3_bucket_policy.exposure_config: Refreshing state... [id=covid-shield-exposure-config-staging]
module.in_app_metrics.module.csv_etl.aws_cloudwatch_log_group.masked_metrics: Refreshing state... [id=/aws/lambda/masked_metrics]
module.in_app_metrics.module.csv_etl.aws_lambda_permission.allow-cloudwatch-to-call-masked_metrics: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.in_app_metrics.module.csv_etl.aws_cloudwatch_event_target.tigger-masked_metrics: Refreshing state... [id=twice-a-day-masked_metrics]
module.in_app_metrics.module.csv_etl.aws_cloudwatch_event_target.tigger-unmasked_metrics: Refreshing state... [id=twice-a-day-unmasked_metrics]
module.in_app_metrics.module.csv_etl.aws_cloudwatch_log_group.unmasked_metrics: Refreshing state... [id=/aws/lambda/unmasked_metrics]
aws_security_group_rule.covidshield_key_submission_ingress_alb: Refreshing state... [id=sgrule-3675801171]
module.in_app_metrics.module.csv_etl.aws_lambda_permission.allow-cloudwatch-to-call-unmasked_metrics: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_lb.covidshield_key_retrieval: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:005133826942:loadbalancer/app/covidshield-key-retrieval/50d87157735ad56c]
aws_lb.covidshield_key_submission: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:005133826942:loadbalancer/app/covidshield-key-submission/00743585bbc9c7b9]
aws_security_group_rule.covidshield_key_retrieval_ingress_alb: Refreshing state... [id=sgrule-2893084300]
aws_vpc_endpoint.ecr-api: Refreshing state... [id=vpce-00fcf8f057a8aed2d]
aws_iam_role_policy_attachment.secrets_manager_key_retrieval: Refreshing state... [id=KeyRetrieval-20200602222527744300000005]
aws_vpc_endpoint.ecr-dkr: Refreshing state... [id=vpce-06f9d455bfc92cb6d]
aws_elasticache_replication_group.covidshield[0]: Refreshing state... [id=covidshield]
aws_rds_cluster.covidshield_server: Refreshing state... [id=server-cluster]
aws_flow_log.vpc_flow_logs: Refreshing state... [id=fl-0a670007e64c4caa5]
aws_wafv2_web_acl_association.waf_association: Refreshing state... [id=arn:aws:wafv2:ca-central-1:005133826942:regional/webacl/metrics_collection1/378af4bf-0cc4-466d-b45f-68231da0cb7a,arn:aws:apigateway:ca-central-1::/restapis/rpjvmf2ukd/stages/staging]
aws_api_gateway_base_path_mapping.metrics: Refreshing state... [id=metrics.wild-samphire.cdssandbox.xyz/]
aws_cloudwatch_log_metric_filter.unauthorized_upload_requests: Refreshing state... [id=UnauthorizedUploadRequests]
aws_cloudwatch_log_metric_filter.unauthorized_one_time_code_claim_requests: Refreshing state... [id=UnauthorizedOneTimeCodeClaimRequests]
aws_cloudwatch_log_metric_filter.key_clear_called: Refreshing state... [id=KeyClearCalled]
aws_cloudwatch_log_metric_filter.fatal_logged: Refreshing state... [id=FatalLogged]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[0]: Refreshing state... [id=ClaimedOneTimeCodeTotal0]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[5]: Refreshing state... [id=ClaimedOneTimeCodeTotal5]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[3]: Refreshing state... [id=ClaimedOneTimeCodeTotal3]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[4]: Refreshing state... [id=ClaimedOneTimeCodeTotal4]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[1]: Refreshing state... [id=ClaimedOneTimeCodeTotal1]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[2]: Refreshing state... [id=ClaimedOneTimeCodeTotal2]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[6]: Refreshing state... [id=ClaimedOneTimeCodeTotal6]
aws_cloudwatch_log_metric_filter.ClaimedOneTimeCodeTotal[7]: Refreshing state... [id=ClaimedOneTimeCodeTotal7]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[6]: Refreshing state... [id=UnclaimedOneTimeCodeTotal6]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[3]: Refreshing state... [id=UnclaimedOneTimeCodeTotal3]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[2]: Refreshing state... [id=UnclaimedOneTimeCodeTotal2]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[4]: Refreshing state... [id=UnclaimedOneTimeCodeTotal4]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[7]: Refreshing state... [id=UnclaimedOneTimeCodeTotal7]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[1]: Refreshing state... [id=UnclaimedOneTimeCodeTotal1]
aws_cloudwatch_log_metric_filter.error_logged: Refreshing state... [id=ErrorLogged]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[0]: Refreshing state... [id=UnclaimedOneTimeCodeTotal0]
aws_cloudwatch_log_metric_filter.UnclaimedOneTimeCodeTotal[5]: Refreshing state... [id=UnclaimedOneTimeCodeTotal5]
aws_cloudwatch_log_metric_filter.five_hundred_response: Refreshing state... [id=500Response]
aws_api_gateway_method_response.response_500: Refreshing state... [id=agmr-rpjvmf2ukd-v2izi2-POST-500]
aws_cloudwatch_log_metric_filter.unauthorized_new_one_time_code_requests: Refreshing state... [id=UnauthorizedNewOneTimeCodeRequests]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[3]: Refreshing state... [id=DiagnosisKeyTotal3]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[5]: Refreshing state... [id=DiagnosisKeyTotal5]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[0]: Refreshing state... [id=DiagnosisKeyTotal0]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[2]: Refreshing state... [id=DiagnosisKeyTotal2]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[1]: Refreshing state... [id=DiagnosisKeyTotal1]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[6]: Refreshing state... [id=DiagnosisKeyTotal6]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[7]: Refreshing state... [id=DiagnosisKeyTotal7]
aws_cloudwatch_log_metric_filter.DiagnosisKeyTotal[4]: Refreshing state... [id=DiagnosisKeyTotal4]
aws_api_gateway_method_response.response_200: Refreshing state... [id=agmr-rpjvmf2ukd-v2izi2-POST-200]
aws_api_gateway_method_settings.method_settings: Refreshing state... [id=rpjvmf2ukd-staging-save-metrics/POST]
aws_cloudwatch_metric_alarm.ClaimedOneTimeCodeTotalWarn: Refreshing state... [id=ClaimedOneTimeCodeTotalWarn]
aws_cloudwatch_metric_alarm.UnclaimedOneTimeCodeTotalWarn: Refreshing state... [id=UnclaimedOneTimeCodeTotalWarn]
aws_cloudwatch_metric_alarm.DiagnosisKeyTotalWarn: Refreshing state... [id=DiagnosisKeyTotalWarn]
aws_cloudwatch_metric_alarm.metrics_api_gateway_max_latency_threshold: Refreshing state... [id=metrics-api-gateway-above-maximum-latency]
aws_cloudwatch_metric_alarm.DiagnosisKeyTotalCritical: Refreshing state... [id=DiagnosisKeyTotalCritical]
aws_cloudwatch_metric_alarm.UnclaimedOneTimeCodeTotalCritical: Refreshing state... [id=UnclaimedOneTimeCodeTotalCritical]
aws_cloudwatch_metric_alarm.ClaimedOneTimeCodeTotalCritical: Refreshing state... [id=ClaimedOneTimeCodeTotalCritical]
aws_cloudwatch_metric_alarm.metrics_api_gateway_min_invocations_threshold: Refreshing state... [id=metrics-api-gateway-below-minimum-invocations]
aws_cloudwatch_metric_alarm.metrics_api_gateway_errors_above_threshold: Refreshing state... [id=metrics-api-gateway-errors-above-threshold]
module.in_app_metrics.aws_iam_role_policy_attachment.backoff_read_write_and_encrypt_deadletter_queue: Refreshing state... [id=backoff_lambda_role-20210212154558971800000005]
module.in_app_metrics.aws_iam_role_policy_attachment.aggregator_write_and_encrypt_deadletter_queue: Refreshing state... [id=aggregate_lambda_role-20210211163817451000000001]
module.in_app_metrics.module.metrics_data_vm.aws_instance.dev_work: Refreshing state... [id=i-03c289eafd09c6e75]
aws_lambda_function.metrics: Refreshing state... [id=save-metrics]
module.in_app_metrics.module.metrics_data_vm.aws_route_table_association.a: Refreshing state... [id=rtbassoc-0ff8f953ea1ca7f9d]
module.in_app_metrics.module.csv_etl.aws_security_group_rule.covidshield_key_retrieval_egress_dynamodb_privatelink: Refreshing state... [id=sgrule-383174822]
aws_wafv2_web_acl_logging_configuration.firehose_waf_logs_retrieval_cdn: Refreshing state... [id=arn:aws:wafv2:us-east-1:005133826942:global/webacl/key_retrieval_cdn/c70e4ca5-1d56-4909-9611-b994a42d22fa]
module.in_app_metrics.module.csv_etl.aws_route_table_association.a: Refreshing state... [id=rtbassoc-070e4b6f8eeb7d8fe]
module.in_app_metrics.module.csv_etl.aws_security_group_rule.covidshield_key_retrieval_egress_s3_privatelink: Refreshing state... [id=sgrule-3399096679]
module.in_app_metrics.aws_cloudwatch_log_group.backoff_log_group: Refreshing state... [id=/aws/lambda/backoff_retry]
module.in_app_metrics.aws_cloudwatch_metric_alarm.backoff_retry_average_duration: Refreshing state... [id=save-metrics-average-duration]
module.in_app_metrics.module.csv_etl.aws_iam_role_policy_attachment.metrics_csv_s3_write: Refreshing state... [id=metrics_csv_lambda_role-20210427205054308200000005]
aws_wafv2_web_acl_logging_configuration.firehose_waf_logs: Refreshing state... [id=arn:aws:wafv2:ca-central-1:005133826942:regional/webacl/key_submission/a4a38f51-4df7-4869-b85d-c5efcad21975]
aws_wafv2_web_acl_logging_configuration.firehose_waf_logs_retrieval: Refreshing state... [id=arn:aws:wafv2:ca-central-1:005133826942:regional/webacl/key_retrieval/691f016d-bf45-4ae9-979a-a9df848ea422]
module.in_app_metrics.aws_lambda_event_source_mapping.dead_letters: Refreshing state... [id=1eb7192c-4708-48c3-af07-a849b8e0cbb6]
aws_lb_listener.covidshield_key_retrieval_test: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:005133826942:listener/app/covidshield-key-retrieval/50d87157735ad56c/5194911373d259ac]
aws_lambda_function.retrieval_lambda_validate_deploy: Refreshing state... [id=RetrievalValidateBeforeTraffic]
aws_cloudwatch_metric_alarm.unauthorized_upload_requests_critical: Refreshing state... [id=UnauthorizedUploadRequestsCritical]
aws_cloudwatch_metric_alarm.unauthorized_upload_requests_warn: Refreshing state... [id=UnauthorizedUploadRequestsWarn]
module.in_app_metrics.aws_cloudwatch_metric_alarm.aggregate_metrics_average_duration: Refreshing state... [id=aggregate-metrics-average-duration]
module.in_app_metrics.aws_cloudwatch_dashboard.metrics_ops_dashboard: Refreshing state... [id=MetricsOps]
module.in_app_metrics.aws_cloudwatch_log_group.metrics: Refreshing state... [id=/aws/lambda/aggregate_metrics]
aws_cloudwatch_metric_alarm.unauthorized_one_time_code_claim_requests_critical: Refreshing state... [id=UnauthorizedOneTimeCodeClaimRequestsCritical]
aws_cloudwatch_metric_alarm.ddos_detected_retrieval: Refreshing state... [id=DDoSDetectedRetrievalALB]
aws_wafv2_web_acl_association.key_retrieval_assocation: Refreshing state... [id=arn:aws:wafv2:ca-central-1:005133826942:regional/webacl/key_retrieval/691f016d-bf45-4ae9-979a-a9df848ea422,arn:aws:elasticloadbalancing:ca-central-1:005133826942:loadbalancer/app/covidshield-key-retrieval/50d87157735ad56c]
module.in_app_metrics.aws_lambda_event_source_mapping.raw_metric_stream: Refreshing state... [id=d99ac36d-c848-4a4f-a040-f3a7df85139a]
aws_shield_protection.alb_covidshield_key_retrieval[0]: Refreshing state... [id=52be9ccf-d751-4dbd-835a-10da0c348077]
aws_lb_listener.covidshield_key_retrieval: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:005133826942:listener/app/covidshield-key-retrieval/50d87157735ad56c/fc199d80f40d661c]
aws_lb_listener.covidshield_key_submission_test: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:005133826942:listener/app/covidshield-key-submission/00743585bbc9c7b9/a5900994e491bbdc]
aws_wafv2_web_acl_association.key_submission_assocation: Refreshing state... [id=arn:aws:wafv2:ca-central-1:005133826942:regional/webacl/key_submission/a4a38f51-4df7-4869-b85d-c5efcad21975,arn:aws:elasticloadbalancing:ca-central-1:005133826942:loadbalancer/app/covidshield-key-submission/00743585bbc9c7b9]
aws_lambda_function.submission_lambda_validate_deploy: Refreshing state... [id=SubmissionValidateBeforeTraffic]
aws_cloudwatch_metric_alarm.ddos_detected_submission: Refreshing state... [id=DDoSDetectedSubmissionALB]
aws_cloudfront_distribution.key_retrieval_distribution: Refreshing state... [id=E32JQ26FGBXFB9]
aws_cloudwatch_metric_alarm.unauthorized_one_time_code_claim_requests_warn: Refreshing state... [id=UnauthorizedOneTimeCodeClaimRequestsWarn]
aws_cloudwatch_metric_alarm.key_clear_called_warn: Refreshing state... [id=KeyClearCalledWarn]
aws_cloudwatch_metric_alarm.fatal_logged_warn: Refreshing state... [id=FatalLoggedWarn]
aws_lb_listener.covidshield_key_submission: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:005133826942:listener/app/covidshield-key-submission/00743585bbc9c7b9/92b1ea8b2c9510e1]
aws_shield_protection.alb_covidshield_key_submission[0]: Refreshing state... [id=ac6d6d4d-7e27-4c21-9cda-3db2003214eb]
aws_route53_record.covidshield_key_submission: Refreshing state... [id=Z04433932EK0CRE7JPWYS_submission.wild-samphire.cdssandbox.xyz._A]
aws_secretsmanager_secret_version.server_database_url: Refreshing state... [id=arn:aws:secretsmanager:ca-central-1:005133826942:secret:server-database-url-0r6pob-fA6Kbq|8A107EAD-40A2-492D-A143-F415F5749664]
aws_rds_cluster_instance.covidshield_server_instances[1]: Refreshing state... [id=server-instance-1]
aws_cloudwatch_metric_alarm.error_logged_warn: Refreshing state... [id=ErrorLoggedWarn]
aws_rds_cluster_instance.covidshield_server_instances[2]: Refreshing state... [id=server-instance-2]
aws_rds_cluster_instance.covidshield_server_instances[0]: Refreshing state... [id=server-instance-0]
aws_cloudwatch_metric_alarm.error_logged_critical: Refreshing state... [id=ErrorLoggedCritical]
aws_cloudwatch_metric_alarm.five_hundred_response_critical: Refreshing state... [id=500ResponseCritical]
aws_cloudwatch_metric_alarm.five_hundred_response_warn: Refreshing state... [id=500ResponseWarn]
aws_cloudwatch_metric_alarm.unauthorized_new_one_time_code_requests_critical: Refreshing state... [id=UnauthorizedNewOneTimeCodeRequestsCritical]
aws_cloudwatch_metric_alarm.unauthorized_new_one_time_code_requests_warn: Refreshing state... [id=UnauthorizedNewOneTimeCodeRequestsWarn]
aws_lambda_permission.apigw: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.metrics: Refreshing state... [id=agi-rpjvmf2ukd-v2izi2-POST]
aws_cloudwatch_metric_alarm.save_metrics_average_duration: Refreshing state... [id=save-metrics-average-duration]
aws_cloudwatch_metric_alarm.ddos_detected_cdn: Refreshing state... [id=DDoSDetectedCDN]
aws_route53_record.covidshield_key_retrieval: Refreshing state... [id=Z04433932EK0CRE7JPWYS_retrieval.wild-samphire.cdssandbox.xyz._A]
aws_shield_protection.key_retrieval_distribution[0]: Refreshing state... [id=0d13b65f-f8bd-4b05-a2de-770f954d639b]
aws_ecs_task_definition.covidshield_key_retrieval: Refreshing state... [id=KeyRetrieval]
aws_ecs_task_definition.covidshield_key_submission: Refreshing state... [id=KeySubmission]
aws_ecs_service.covidshield_key_submission: Refreshing state... [id=arn:aws:ecs:ca-central-1:005133826942:service/CovidShield/KeySubmission]
aws_ecs_service.covidshield_key_retrieval: Refreshing state... [id=arn:aws:ecs:ca-central-1:005133826942:service/CovidShield/KeyRetrieval]
aws_cloudwatch_metric_alarm.retrieval_cpu_utilization_high: Refreshing state... [id=retrieval-cpu-utilization-high]
aws_cloudwatch_metric_alarm.retrieval_memory_utilization_high: Refreshing state... [id=retrieval-memory-utilization-high]
module.covid-shield-retrieval.aws_codedeploy_app.app: Refreshing state... [id=51f07c9a-b972-4865-b6ca-a9e8bdaeda2a:AppECS-CovidShield-KeyRetrieval]
module.covid-shield-submission.aws_codedeploy_app.app: Refreshing state... [id=cab4ad0b-ba11-4cca-82a5-923b35b089f1:AppECS-CovidShield-KeySubmission]
aws_cloudwatch_metric_alarm.submission_memory_utilization_high: Refreshing state... [id=submission-memory-utilization-high]
aws_cloudwatch_metric_alarm.submission_cpu_utilization_high: Refreshing state... [id=submission-cpu-utilization-high]
module.covid-shield-retrieval.aws_codedeploy_deployment_group.app: Refreshing state... [id=6e321c06-ff3a-42be-9fe6-1b92b8167cc3]
module.covid-shield-submission.aws_codedeploy_deployment_group.app: Refreshing state... [id=2b72c17e-0829-4ed0-903f-7d35de18ff2f]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_deployment.metrics will be created
  + resource "aws_api_gateway_deployment" "metrics" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "rpjvmf2ukd"
      + triggers      = (known after apply)
    }

  # aws_api_gateway_stage.metrics will be updated in-place
  ~ resource "aws_api_gateway_stage" "metrics" {
      ~ deployment_id         = "5bgyjo" -> (known after apply)
        id                    = "ags-rpjvmf2ukd-staging"
        tags                  = {}
        # (8 unchanged attributes hidden)
    }

  # module.in_app_metrics.aws_cloudwatch_metric_alarm.backoff_retry_average_duration will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "backoff_retry_average_duration" {
      ~ alarm_description         = "This metric monitors average duration for the save_metrics lambda" -> "This metric monitors average duration for the backoff_retry lambda"
      ~ dimensions                = {
          ~ "FunctionName" = "save-metrics" -> "backoff_retry"
        }
        id                        = "save-metrics-average-duration"
        tags                      = {}
        # (15 unchanged attributes hidden)
    }

  # module.in_app_metrics.module.csv_etl.aws_default_network_acl.default will be updated in-place
  ~ resource "aws_default_network_acl" "default" {
        id                     = "acl-08dd94cb5d2af94e4"
      ~ subnet_ids             = [
          - "subnet-06523554550d482c3",
          - "subnet-0ad10d2c67c9651ee",
        ]
        tags                   = {
            "Name" = "csv_etl_default_nacl"
        }
        # (4 unchanged attributes hidden)


        # (3 unchanged blocks hidden)
    }

  # module.in_app_metrics.module.csv_etl.aws_lambda_function.masked_metrics will be updated in-place
  ~ resource "aws_lambda_function" "masked_metrics" {
        id                             = "masked_metrics"
        tags                           = {}
        # (16 unchanged attributes hidden)



      ~ vpc_config {
          ~ security_group_ids = [
              - "sg-0ba55405eef7b6c94",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }
        # (2 unchanged blocks hidden)
    }

  # module.in_app_metrics.module.csv_etl.aws_lambda_function.unmasked_metrics will be updated in-place
  ~ resource "aws_lambda_function" "unmasked_metrics" {
        id                             = "unmasked_metrics"
        tags                           = {}
        # (16 unchanged attributes hidden)



      ~ vpc_config {
          ~ security_group_ids = [
              - "sg-0ba55405eef7b6c94",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }
        # (2 unchanged blocks hidden)
    }

  # module.in_app_metrics.module.csv_etl.aws_security_group.lambda must be replaced
-/+ resource "aws_security_group" "lambda" {
      ~ arn                    = "arn:aws:ec2:ca-central-1:005133826942:security-group/sg-0ba55405eef7b6c94" -> (known after apply)
      ~ description            = "Managed by Terraform" -> "Used by lamba for access to the internet and the S3/DynamoDB private endpoints" # forces replacement
      ~ egress                 = [] -> (known after apply)
      ~ id                     = "sg-0ba55405eef7b6c94" -> (known after apply)
      ~ ingress                = [] -> (known after apply)
      ~ name                   = "terraform-20210427203323746900000001" -> (known after apply)
      ~ name_prefix            = "terraform-" -> (known after apply)
      ~ owner_id               = "005133826942" -> (known after apply)
        tags                   = {
            "Name" = "csv_etl_lambda_sg"
        }
        # (2 unchanged attributes hidden)
    }

  # module.in_app_metrics.module.csv_etl.aws_security_group_rule.covidshield_key_retrieval_egress_dynamodb_privatelink will be created
  + resource "aws_security_group_rule" "covidshield_key_retrieval_egress_dynamodb_privatelink" {
      + description              = "Security group rule for Retrieval dynamodb egress through privatelink"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = [
          + "pl-4ea54027",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.in_app_metrics.module.csv_etl.aws_security_group_rule.covidshield_key_retrieval_egress_s3_privatelink will be created
  + resource "aws_security_group_rule" "covidshield_key_retrieval_egress_s3_privatelink" {
      + description              = "Security group rule for Retrieval S3 egress through privatelink"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = [
          + "pl-7da54014",
        ]
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.in_app_metrics.module.csv_etl.aws_security_group_rule.inet_egress will be created
  + resource "aws_security_group_rule" "inet_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow lambda egress to the internet"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

Plan: 5 to add, 5 to change, 1 to destroy.

Changes to Outputs:
  ~ base_url = "https://rpjvmf2ukd.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @patheard, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*